Tekla Open API Reference for Tekla Structures 2025
ErrorDialog.Severity Enumeration
 The severity of the message to be displayed.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum Severity
Public Enumeration Severity
Members
Member name | Value | Description
INFO | 0 |  The message is for informing.
WARNING | 1 |  The message is for warning.
ERROR | 2 |  The message is for notifying that an error has occurred.
See Also
Reference
Tekla.Structures.Dialog Namespace